Cases/container/container_base/system/airInside/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

U
{
    internalField   uniform (0 0 0);

    boundaryField
    {
        container
        {
            type            noSlip;
        }
        // symmetryPlanes
        // {
		// 	type            symmetry;
        // }
        airInside_to_batterie0
        {
            type            noSlip;
        }
    }
}

T
{
    internalField   uniform 270;

    boundaryField
    {
        container
        {
            type            externalWallHeatFluxTemperature;

            // option 1
            mode             coefficient;     // ambient temp. and htc
            Ta               constant 300.0;
            h                uniform 10.0;
    
            // option 2
            // mode             power; 
            // Q                10;              // [10W]
    
            // // option 3
            // mode             flux;
            // q                   uniform 10.0; // [10W/m²]
    
            thicknessLayers (2);
            kappaLayers     (0.5);

            kappaMethod fluidThermo;

            qr qr;
    
            value           $internalField;
        }
        // symmetryPlanes
        // {
		// 	type            symmetry;
        // }
        airInside_to_batterie0
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;
            Tnbr            T;
            kappaMethod     fluidThermo;
            value           $internalField;
        }
    }
}

p_rgh
{
    internalField   uniform 1e5;

    boundaryField
    {
        container
        {
            type            fixedFluxPressure;
            value           $internalField;
        }
        // air
        // {
        //     type            totalPressure;
        //     p0              $internalField;
        //     value           $internalField;
        // }
        // symmetryPlanes
        // {
		// 	type            symmetry;
        // }
        airInside_to_batterie0
        {
            type    fixedFluxPressure;
            value   $internalField;
        }
    }
}

p
{
    internalField   uniform 1e5;

    boundaryField
    {
        // symmetryPlanes
        // {
		// 	type            symmetry;
        // }
        ".*"
        {
            type            calculated;
            value           $internalField;
        }
    }
}

// ************************************************************************* //
